import Container from "../shared/Container";

const items: { title: string; description: string; icon: React.ReactNode }[] = [
  {
    title: "Ответьте на пару вопросов",
    description:
      "Короткий чек-лист, чтобы понять, насколько нужна помощь в быту",
    icon: (
      <svg
        width="28"
        height="28"
        viewBox="0 0 28 28"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
        className="shrink-0"
      >
        <path
          d="M10.605 10.5C10.8793 9.72027 11.4207 9.06278 12.1333 8.64398C12.8459 8.22518 13.6837 8.07208 14.4984 8.21182C15.313 8.35156 16.052 8.7751 16.5843 9.40744C17.1166 10.0398 17.4079 10.8401 17.4067 11.6667C17.4067 14 13.9067 15.1667 13.9067 15.1667M14 19.8333H14.0117M3.49067 19.0657C3.66221 19.4984 3.70041 19.9725 3.60033 20.4272L2.35783 24.2655C2.3178 24.4601 2.32815 24.6618 2.38791 24.8513C2.44766 25.0409 2.55484 25.212 2.69928 25.3485C2.84372 25.485 3.02063 25.5823 3.21323 25.6312C3.40584 25.6802 3.60776 25.6791 3.79983 25.6282L7.78167 24.4638C8.21067 24.3787 8.65495 24.4159 9.06383 24.5712C11.5551 25.7346 14.3773 25.9807 17.0323 25.2662C19.6874 24.5516 22.0048 22.9222 23.5756 20.6656C25.1465 18.4089 25.8698 15.67 25.618 12.932C25.3662 10.194 24.1555 7.63287 22.1994 5.70055C20.2433 3.76823 17.6677 2.58887 14.9268 2.37053C12.1859 2.1522 9.45599 2.90893 7.21868 4.50722C4.98137 6.1055 3.38045 8.44262 2.69838 11.1062C2.0163 13.7698 2.2969 16.5888 3.49067 19.0657Z"
          stroke="#008270"
          strokeWidth="2"
          strokeLinecap="round"
          strokeLinejoin="round"
        />
      </svg>
    ),
  },
  {
    title: "Выберите, что беспокоит",
    description: "Отметьте категории нарушений, которые актуальны сейчас",
    icon: (
      <svg
        width="28"
        height="28"
        viewBox="0 0 28 28"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
        className="shrink-0"
      >
        <path
          d="M24.5 12.432V22.1667C24.5 22.7855 24.2542 23.379 23.8166 23.8166C23.379 24.2542 22.7855 24.5 22.1667 24.5H5.83333C5.21449 24.5 4.621 24.2542 4.18342 23.8166C3.74583 23.379 3.5 22.7855 3.5 22.1667V5.83333C3.5 5.21449 3.74583 4.621 4.18342 4.18342C4.621 3.74583 5.21449 3.5 5.83333 3.5H20.2347M10.5 12.8333L14 16.3333L25.6667 4.66667"
          stroke="#008270"
          strokeWidth="2"
          strokeLinecap="round"
          strokeLinejoin="round"
        />
      </svg>
    ),
  },
  {
    title: "Укажите текущее состояние",
    description: "Выберите вариант, который лучше всего описывает ситуацию",
    icon: (
      <svg
        width="28"
        height="28"
        viewBox="0 0 28 28"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
        className="shrink-0"
      >
        <path
          d="M18.6667 4.66665H21C21.6189 4.66665 22.2124 4.91248 22.6499 5.35006C23.0875 5.78765 23.3334 6.38114 23.3334 6.99998V23.3333C23.3334 23.9522 23.0875 24.5456 22.6499 24.9832C22.2124 25.4208 21.6189 25.6666 21 25.6666H7.00002C6.38118 25.6666 5.78769 25.4208 5.3501 24.9832C4.91252 24.5456 4.66669 23.9522 4.66669 23.3333V6.99998C4.66669 6.38114 4.91252 5.78765 5.3501 5.35006C5.78769 4.91248 6.38118 4.66665 7.00002 4.66665H9.33335M14 12.8333H18.6667M14 18.6666H18.6667M9.33335 12.8333H9.34502M9.33335 18.6666H9.34502M10.5 2.33331H17.5C18.1444 2.33331 18.6667 2.85565 18.6667 3.49998V5.83331C18.6667 6.47765 18.1444 6.99998 17.5 6.99998H10.5C9.85569 6.99998 9.33335 6.47765 9.33335 5.83331V3.49998C9.33335 2.85565 9.85569 2.33331 10.5 2.33331Z"
          stroke="#008270"
          strokeWidth="2"
          strokeLinecap="round"
          strokeLinejoin="round"
        />
      </svg>
    ),
  },
  {
    title: "Узнайте время реабилитации",
    description:
      "Покажем примерный итог в часах, днях и предложим следующий шаг",
    icon: (
      <svg
        width="28"
        height="28"
        viewBox="0 0 28 28"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
        className="shrink-0"
      >
        <path
          d="M18.6666 16.3333V18.9L20.5333 20.0666M18.6666 4.66665H21C21.6188 4.66665 22.2123 4.91248 22.6499 5.35006C23.0875 5.78765 23.3333 6.38114 23.3333 6.99998V7.97065M9.33329 4.66665H6.99996C6.38112 4.66665 5.78763 4.91248 5.35004 5.35006C4.91246 5.78765 4.66663 6.38114 4.66663 6.99998V23.3333C4.66663 23.9522 4.91246 24.5456 5.35004 24.9832C5.78763 25.4208 6.38112 25.6666 6.99996 25.6666H9.33329M25.6666 18.6666C25.6666 22.5326 22.5326 25.6666 18.6666 25.6666C14.8006 25.6666 11.6666 22.5326 11.6666 18.6666C11.6666 14.8007 14.8006 11.6666 18.6666 11.6666C22.5326 11.6666 25.6666 14.8007 25.6666 18.6666ZM10.5 2.33331H17.5C18.1443 2.33331 18.6666 2.85565 18.6666 3.49998V5.83331C18.6666 6.47765 18.1443 6.99998 17.5 6.99998H10.5C9.85563 6.99998 9.33329 6.47765 9.33329 5.83331V3.49998C9.33329 2.85565 9.85563 2.33331 10.5 2.33331Z"
          stroke="#008270"
          strokeWidth="2"
          strokeLinecap="round"
          strokeLinejoin="round"
        />
      </svg>
    ),
  },
];

export default function SubHero() {
  return (
    <section id="sub-hero">
      <Container className="grid sm:grid-cols-2 lg:grid-cols-4 gap-3.75 sm:gap-6.5 lg:pt-5 lg:pb-9">
        {items.map((item) => (
          <div
            key={item.title}
            className="space-y-3.75 bg-brand-green-75 rounded-brand-xl p-3.75 xs:p-5"
          >
            {item.icon}
            <h3 className="leading-5.5 sm:text-xl/6.75 font-medium sm:font-semibold">
              {item.title}
            </h3>
            <p className="text-sm/5 sm:text-base/5.5">{item.description}</p>
          </div>
        ))}
      </Container>
    </section>
  );
}
